Revit 2024 API
ExternalResourceServiceUtils Class
 Contains utilities related to external resource service.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static class ExternalResourceServiceUtils
Visual Basic
Public NotInheritable Class ExternalResourceServiceUtils
Visual C++
public ref class ExternalResourceServiceUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceServiceUtils
See Also
ExternalResourceServiceUtils Members
Autodesk.Revit.DB Namespace